; ModuleID = './myTestCases/main.c'
source_filename = "./myTestCases/main.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx14.0.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@.str = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"{\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"}\0A\00", align 1
@.str.4 = private unnamed_addr constant [31 x i8] c"Error: Failed to open file %s\0A\00", align 1
@main._B = internal global i8* null, align 8, !dbg !0
@.str.5 = private unnamed_addr constant [23 x i8] c"##SIG_AFL_PERSISTENT##\00", align 1
@__afl_connected = external local_unnamed_addr global i32, align 4
@__stdinp = external local_unnamed_addr global %struct.__sFILE*, align 8
@.str.6 = private unnamed_addr constant [14 x i8] c"__memrchr.cpp\00", align 1
@.str.7 = private unnamed_addr constant [48 x i8] c"void *__memrchr(const void *m, int c, size_t n)\00", align 1
@.str.8 = private unnamed_addr constant [19 x i8] c"ret == valuestring\00", align 1
@__afl_area_ptr = external global i8*
@__afl_api_spec = external global i32*

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_B", scope: !2, file: !3, line: 32, type: !26, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 30, type: !4, scopeLine: 30, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !17)
!3 = !DIFile(filename: "./myTestCases/main.c", directory: "/Users/shuangxiangkan/Fuzz/AFLplusplus")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !8, producer: "Homebrew clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !9, globals: !16, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!8 = !DIFile(filename: "myTestCases/main.c", directory: "/Users/shuangxiangkan/Fuzz/AFLplusplus")
!9 = !{!10, !11, !13, !15}
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !{!0}
!17 = !{!18, !23, !24, !25}
!18 = !DILocalVariable(name: "m", scope: !19, file: !3, line: 41, type: !20)
!19 = distinct !DILexicalBlock(scope: !2, file: !3, line: 33, column: 2)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 1024)
!23 = !DILocalVariable(name: "ret", scope: !19, file: !3, line: 46, type: !11)
!24 = !DILocalVariable(name: "fileName", scope: !19, file: !3, line: 51, type: !11)
!25 = !DILocalVariable(name: "funSignature", scope: !19, file: !3, line: 52, type: !11)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !12)
!29 = !{i32 7, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 4}
!32 = !{i32 1, !"branch-target-enforcement", i32 0}
!33 = !{i32 1, !"sign-return-address", i32 0}
!34 = !{i32 1, !"sign-return-address-all", i32 0}
!35 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!36 = !{i32 7, !"PIC Level", i32 2}
!37 = !{i32 7, !"uwtable", i32 1}
!38 = !{i32 7, !"frame-pointer", i32 1}
!39 = !{!"Homebrew clang version 14.0.6"}
!40 = distinct !DISubprogram(name: "SpecFileGeneration", scope: !3, file: !3, line: 7, type: !41, scopeLine: 8, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !43)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !13, !13, !13}
!43 = !{!44, !45, !46, !47}
!44 = !DILocalVariable(name: "specification", arg: 1, scope: !40, file: !3, line: 7, type: !13)
!45 = !DILocalVariable(name: "fileName", arg: 2, scope: !40, file: !3, line: 7, type: !13)
!46 = !DILocalVariable(name: "funSignature", arg: 3, scope: !40, file: !3, line: 7, type: !13)
!47 = !DILocalVariable(name: "file", scope: !40, file: !3, line: 9, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !50, line: 157, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !50, line: 126, size: 1216, elements: !52)
!52 = !{!53, !55, !56, !57, !59, !60, !65, !66, !67, !71, !75, !85, !89, !90, !93, !94, !98, !102, !103, !104}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !51, file: !50, line: 127, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !51, file: !50, line: 128, baseType: !6, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !51, file: !50, line: 129, baseType: !6, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !50, line: 130, baseType: !58, size: 16, offset: 128)
!58 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !51, file: !50, line: 131, baseType: !58, size: 16, offset: 144)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !51, file: !50, line: 132, baseType: !61, size: 128, offset: 192)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !50, line: 92, size: 128, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !61, file: !50, line: 93, baseType: !54, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !61, file: !50, line: 94, baseType: !6, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !51, file: !50, line: 133, baseType: !6, size: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !51, file: !50, line: 136, baseType: !15, size: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !51, file: !50, line: 137, baseType: !68, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!6, !15}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !51, file: !50, line: 138, baseType: !72, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!6, !15, !11, !6}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !51, file: !50, line: 139, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !15, !79, !6}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !50, line: 81, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !81, line: 71, baseType: !82)
!81 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !83, line: 24, baseType: !84)
!83 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/arm/_types.h", directory: "")
!84 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !51, file: !50, line: 140, baseType: !86, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!6, !15, !13, !6}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !51, file: !50, line: 143, baseType: !61, size: 128, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !51, file: !50, line: 144, baseType: !91, size: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !50, line: 98, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !51, file: !50, line: 145, baseType: !6, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !51, file: !50, line: 148, baseType: !95, size: 24, offset: 928)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 24, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !51, file: !50, line: 149, baseType: !99, size: 8, offset: 952)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !51, file: !50, line: 152, baseType: !61, size: 128, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !51, file: !50, line: 155, baseType: !6, size: 32, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !50, line: 156, baseType: !79, size: 64, offset: 1152)
!105 = !DILocation(line: 8, scope: !40)
!106 = !{}
!107 = !DILocation(line: 0, scope: !40)
!108 = !DILocation(line: 9, column: 18, scope: !40)
!109 = !DILocation(line: 10, column: 9, scope: !110)
!110 = distinct !DILexicalBlock(scope: !40, file: !3, line: 10, column: 9)
!111 = !DILocation(line: 10, column: 9, scope: !40)
!112 = !DILocation(line: 11, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !110, file: !3, line: 10, column: 15)
!114 = !DILocation(line: 12, column: 9, scope: !113)
!115 = !DILocation(line: 13, column: 9, scope: !113)
!116 = !DILocation(line: 14, column: 9, scope: !113)
!117 = !DILocation(line: 15, column: 9, scope: !113)
!118 = !DILocation(line: 16, column: 5, scope: !113)
!119 = !DILocation(line: 18, column: 9, scope: !120)
!120 = distinct !DILexicalBlock(scope: !110, file: !3, line: 16, column: 12)
!121 = !DILocation(line: 20, column: 1, scope: !40)
!122 = !DISubprogram(name: "fclose", scope: !123, file: !123, line: 143, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!123 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!6, !48}
!126 = distinct !DISubprogram(name: "__memrchr", scope: !3, file: !3, line: 22, type: !127, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !133)
!127 = !DISubroutineType(types: !128)
!128 = !{!11, !13, !6, !129}
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 31, baseType: !131)
!130 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !83, line: 70, baseType: !132)
!132 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!133 = !{!134, !135, !136, !137}
!134 = !DILocalVariable(name: "m", arg: 1, scope: !126, file: !3, line: 22, type: !13)
!135 = !DILocalVariable(name: "c", arg: 2, scope: !126, file: !3, line: 22, type: !6)
!136 = !DILocalVariable(name: "n", arg: 3, scope: !126, file: !3, line: 22, type: !129)
!137 = !DILocalVariable(name: "s", scope: !126, file: !3, line: 24, type: !13)
!138 = !DILocation(line: 23, scope: !126)
!139 = !DILocation(line: 0, scope: !126)
!140 = !DILocation(line: 25, column: 6, scope: !126)
!141 = !DILocation(line: 26, column: 2, scope: !126)
!142 = !DILocation(line: 26, column: 10, scope: !126)
!143 = !DILocation(line: 26, column: 18, scope: !144)
!144 = distinct !DILexicalBlock(scope: !126, file: !3, line: 26, column: 18)
!145 = !{!146, !146, i64 0}
!146 = !{!"omnipotent char", !147, i64 0}
!147 = !{!"Simple C/C++ TBAA"}
!148 = !DILocation(line: 26, column: 22, scope: !144)
!149 = !DILocation(line: 26, column: 18, scope: !126)
!150 = distinct !{!150, !141, !151, !152}
!151 = !DILocation(line: 26, column: 46, scope: !126)
!152 = !{!"llvm.loop.mustprogress"}
!153 = !DILocation(line: 28, column: 1, scope: !126)
!154 = !DILocation(line: 30, scope: !2)
!155 = !DILocation(line: 32, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !2, file: !3, line: 32, column: 9)
!157 = !{!158, !158, i64 0}
!158 = !{!"any pointer", !146, i64 0}
!159 = !{!160, !160, i64 0}
!160 = !{!"int", !146, i64 0}
!161 = !DILocation(line: 32, column: 2, scope: !2)
!162 = !DILocation(line: 41, column: 3, scope: !19)
!163 = !DILocation(line: 41, column: 8, scope: !19)
!164 = !DILocation(line: 42, column: 27, scope: !165)
!165 = distinct !DILexicalBlock(scope: !19, file: !3, line: 42, column: 7)
!166 = !DILocation(line: 42, column: 7, scope: !165)
!167 = !DILocation(line: 42, column: 34, scope: !165)
!168 = !DILocation(line: 42, column: 7, scope: !19)
!169 = !DILocation(line: 0, scope: !126, inlinedAt: !170)
